#------------------------------------------------------------------------------
# qa:
# description:
#------------------------------------------------------------------------------
from sys import maxsize


class Group:
    # method parameters change for default (lesson 3-2)
    # def __init__(self, name, header, footer):

    # None is special value/ None means that field not initialized (lesson 3-2)
    # Добавляем в параметры идентификатор (урок 4-7)
    def __init__(self, name=None, header=None, footer=None, id=None):
        self.name = name
        self.header = header
        self.footer = footer
        self.id = id


    # Для получения информации об объекте реализуем функцию, которая определяет вывод объекта в консоль
    # урок 4-8
    def __repr__(self):
        return "%s:%s" % (self.id, self.name)


    # Определяем функцию для логического сравнения, т. е. по смыслу (по именам, идентификаторам).
    # Без этой функции сравнение идет по ссылкам на расположение в памяти (по физическому
    # расположению объектов, в результате чего 2 объекта с одинаковыми именами и идентификаторами
    # считаются разными объектами (урок 4-8)
    # Дорабатываем метод, чтобы он учитывал неопределенный идентификатор - идентификаторы нужно
    # сравнивать тольок, если они определены, т. е. != None (урок 4-9)
    def __eq__(self, other):
        return (self.id is None or other.id is None or self.id == other.id) and self.name == other.name


    # Добавляем сортировку списков по идентификаторам (урок 4-9)
    # Но перед этим пишем метод, который будет вычислять по группе ключ, используемый для сравнения
    # Новая группа всегда имеет самое большое значения идентификатора, поэтому для группы,
    # добавленной в данном тесте в старую группу, можно назначить в качестве идентификатора какое-то
    # большое число (урок 4-9)
    def id_or_max(gr):
        if gr.id:
            # возвращаемый идентификатор преобразуем из строки в число (урок 4-9)
            return int(gr.id)
        else:
            # В языке Python нет максимального целого числа, поэтому рекомендуется использовать
            # специальную константу maxsize (урок 4-9)
            return maxsize
