#------------------------------------------------------------------------------
# qa:
# description: Тесты, направленные на проверку соответствия БД и UI
#------------------------------------------------------------------------------
from model.group import Group


# Проверяем соответствие списка групп. В качестве параметров передаются фикстуры (урок 7-3)
def test_group_list(app, db):
    ui_list = app.group.get_group_list()

    # В связи с тем, что в БД хранится информация со всеми введенными символами, а в UI лишние
    # символы пробела в начале и конце удаляются, непосредственно при выполнении теста удаляем
    # лишние пробелы в списке, полученном из БД, с помощью функции clean.
    def clean(group):
        return Group(id=group.id, name=group.name.strip())
    db_list = map(clean, db.get_group_list())

    assert sorted(ui_list, key=Group.id_or_max) == sorted(db_list, key=Group.id_or_max)
