#------------------------------------------------------------------------------
# qa:
# description:
#------------------------------------------------------------------------------
import random
import string

import pytest

from model.group import Group



# Добавлен вспомогательный метод для генерации случайных тестовых данных (урок 5-7)
# В качестве параметров передается префикс и параметр, определяющий максимальную длину генерируемой
# строки (урок 5-7)
# " "*10 - увеличение количества символов пробела для повышения вероятности включения пробела в
# сгенерированную строку
def random_string(prefix, maxlen):
    # Определяем символы, которые мы будем использовать для генерации тестовых данных (урок 5-7)
    symbols = string.ascii_letters + string.digits + string.punctuation + " "*10
    # Случайным образом выбираем символ из заданной строки и генерируем данные случайно длины, не
    # превышающей максимальную длину. Склиеваем символы в одну строку (урок 5-7)
    return prefix + "".join([random.choice(symbols) for  i in range(random.randrange(maxlen))])




# Добавляем тестовые данные, определенные вне тестов, для параметризации тестов
# чтобы тестовые данные передавались в тестовую функцию в качестве параметра (урок 5-7)
# В виде фиксированного списка (урок 5-7) - закоментировано после добавления метода генерации
# тестовых данных
# testdata = [
#     Group(name="scasc", header="fdbvd", footer="dsvb"),
#     Group(name="", header="", footer="")
# ]
# В виде сгенерированных тестовых данных (урок 5-7)
# Вариант 1: список из 1 пустой группы и 1 группы с заполненными полями
testdata1 = [
    Group(name=random_string("name", 10), header=random_string("header", 20),\
          footer=random_string("footer", 20)),
    Group(name="", header="", footer="")
]

# Вариант 2: 1 группа с пустыми полями + 5 (для примера) групп с заполненными полями
testdata = [Group(name="", header="", footer="")] + [
    Group(name=random_string("name", 10), header=random_string("header", 20),\
          footer=random_string("footer", 20)) for i in range(5)
]

# Вариант 3: с разными комбинациями заполненности полей (полный перебор возможных случаев)
testdata3 = [
    Group(name=name, header=header, footer=footer)
    for name in ["", random_string("name", 10)]
    for header in ["", random_string("header", 20)]
    for footer in ["", random_string("footer", 20)]
]



# Methods app.session.login() and app.session.logout() have been removed from
# all tests because fixture have been optimized (lesson 3-3)

# Переписываем тесты в соответствии с уроком 4-7 - Загружаем информацию
# из тестируемого приложения в виде списков

# Добавлена парметризация теста (урок 5-7)
# Здесь testdata - исчтоник тестовых данных, group - параметр для передачи тестовых данных в тестовую функцию,
# ids - параметр для формирования списка с текстовым представлением тестовых данных для формирования отчета
# о выполнении теста (чтобы в отчете было видно, с какими именно тестовыми данными выполнялся тест)
@pytest.mark.parametrize("group", testdata, ids=[repr(x) for x in testdata])
def test_add_group(app, group):
    # Получаем старый список групп из приложения
    old_groups = app.group.get_group_list()

    # Для последующего сравнения списков модифицируем тест - объявляем локальную
    # переменную group и передаем ее в качестве параметра в метод создания группы (урок 4-9)
    # Убираем объявление локальной переменной в связи с параметризацией теста (урок 5-7)
    # group = Group(name="", header="", footer="")
    app.group.create(group)

    # Проверяем, что новый список на единицу длинее старого (урок 4-7)
    # Но если данная проверка неуспешна, то дальнейшее поэлементное сравнение списков
    # не имеет смысла. Поэтому для ускорения этой проверки ее надо выполнить, не загружая список групп
    # Для этого меняем проверку: сравнение выполняем не с новым списком, а с подсчитанным количеством групп
    # Новый список загружаем только после успешного выполнения этой проверки. Это и есть хеширование.
    # А функция app.group.count() - это хеш-функция (урок 4-10)
    assert len(old_groups) + 1 == app.group.count()

    # Меняем очередность выполнения сравнения количества групп и получение обновленного
    # нового списка групп, который мы стали получить с урока 4-7 (урок 4-10)
    new_groups = app.group.get_group_list()

    # В список групп, полученный из приложения, добавляем новую группу (урок 4-9)
    old_groups.append(group)

    # # Сравниваем группы, но тест упал, т. к. не совпал порядок групп в списке (урок 4-9)
    # # Поэтому данный метод модифицируем в следующий за ним - с сортировкой (а текущий метод
    # # я закомментировала
    # assert old_groups == new_groups

    # Создаем новую функцию сравнения, в которой указываем в качестве ключа идентификатор - оба
    # списка сортируем по одинаковым правилам (урок 4-9)
    assert sorted(old_groups, key=Group.id_or_max) == sorted(new_groups, key=Group.id_or_max)



# Тест закоментирован в рамках урока 5-7 "Параметризация тестов"
# # Аналогично предыдущему тесту модифицируем и этот тест (урок 4-9)
# def test_add_empty_group(app):
#     old_groups = app.group.get_group_list()
#     group = Group(name="", header="", footer="")
#     app.group.create(group)
#     new_groups = app.group.get_group_list()
#     assert len(old_groups) + 1 == len(new_groups)
#     old_groups.append(group)
#     assert sorted(old_groups, key=Group.id_or_max) == sorted(new_groups, key=Group.id_or_max)
